#include<stdio.h>
int main(){
    int arr[] = {5,3,8,4,2};
    int n = 5;// অ্যারেতে ৫টি সংখ্যা আছে
    int i,j,temp;

   // বাইরের লুপ (কতবার পুরো অ্যারেটা ঘুরতে হবে তার জন্য)
    for (i = 0; i < n - 1; i++){

    // ভেতরের লুপ (পাশাপাশি দুটি সংখ্যা চেক করার জন্য)
        for (j = 0; j < n - i - 1; j++){

            if(arr[j] > arr[j+1]){
            // Swap বা অদলবদল করার লজিক
                temp = arr[j];// প্রথম সংখ্যাটা খালি বাক্সে রাখলাম
                arr[j] = arr[j+1];// দ্বিতীয় সংখ্যাটা প্রথম ঘরে বসালাম
                arr[j+1] = temp;// খালি বাক্সে রাখা প্রথম সংখ্যাটা দ্বিতীয় ঘরে বসালাম
            }
        }
    }
   // সাজানো অ্যারে প্রিন্ট করা
    printf("Sorted Array:");
    for(i = 0; i < n; i++){
        printf("%d ",arr[i]);
    }
    printf("\n");

    return 0;
}
